// lab91.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(0, "");
	int N, N1;
	cout << "Введите номер дня и месяца через пробел: ";
	cin >> N >> N1;
	switch (N)
	{
	case 1: cout << "Первое ";
		break;
	case 2: cout << "Второе ";
		break;
	case 3: cout << "Третье ";
		break;
	case 4: cout << "Четвертое ";
		break;
	case 5: cout << "Пятое ";
		break;
	case 6: cout << "Шестое ";
		break;
	case 7: cout << "Седьмое ";
		break;
	case 8: cout << "Восьмое ";
		break;
	case 9: cout << "Девятое ";
		break;
	case 10: cout << "Десятое ";
		break;
	case 11: cout << "Одиннадцатое";
		break;
	case 12: cout << "Двенадцатое ";
		break;
	case 13: cout << "Тринадцатое ";
		break;
	case 14: cout << "Четырнадцатое ";
		break;
	case 15: cout << "Пятнадцатое ";
		break;
	case 16: cout << "Шестнадцатое ";
		break;
	case 17: cout << "Семнадцатое ";
		break;
	case 18: cout << "Восемнадцатое ";
		break;
	case 19: cout << "Девятнадцатое ";
		break;
	case 20: cout << "Двадцатое ";
		break;
	case 21: cout << "Двадцать первое ";
		break;
	case 22: cout << "Двадцать второе ";
		break;
	case 23: cout << "Двадцать третье ";
		break;
	case 24: cout << "Двадцать четвертое ";
		break;
	case 25: cout << "Двадцать пятое ";
		break;
	case 26: cout << "Двадцать шестое ";
		break;
	case 27: cout << "Двадцать седьмое ";
		break;
	case 28: cout << "Двадцать восьмое ";
		break;
	case 29: cout << "Двадцать девятое ";
		break;
	case 30: cout << "Тридцатое ";
		break;
	case 31: cout << "Тридцать первое ";
		break;
	default: cout << "Введено неверное значение...";
		break;
	}
	switch (N1)
	{
	case 1: cout << "января.";
		break;
	case 2: cout << "февраля.";
		break;
	case 3: cout << "марта.";
		break;
	case 4: cout << "апреля.";
		break;
	case 5: cout << "мая.";
		break;
	case 6: cout << "июня.";
		break;
	case 7: cout << "июля.";
		break;
	case 8: cout << "авгyста.";
		break;
	case 9: cout << "сентября.";
		break;
	case 10: cout << "октября.";
		break;
	case 11: cout << "ноября.";
		break;
	case 12: cout << "декабря.";
		break;
	default: cout << "Введено неверное значение...";
		break;
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
